# 1. Квадрат числа.
# Користувач вводить число. Програма виводить його квадрат.

# x = float(input("Введіть число: "))
# y = x ** 2
# print(y)

# 2. “Середнє трьох чисел”
# Програма запитує три числа і виводить їх середнє арифметичне.

# x = float(input("Введіть число: "))
# y = float(input("Введіть число: "))
# a = float(input("Введіть число: "))

# b = (x + y + a) / 3
# print(b)

# 3. “Перетворення хвилин у години”
# Користувач вводить кількість хвилин. Програма виводить, скільки це годин і хвилин.

# x = int(input("Введіть число: "))
# h, m = divmod(x, 60)
# print(str(h) + " " + "години" + " " + str(m) + " " + "хвилин")

# 4. “Розрахунок знижки”
# Користувач вводить ціну товару і розмір знижки у %. Програма виводить кінцеву ціну.

# a = float(input("Введіть число: "))
# x = float(input("Введіть знижку: "))
# b = a * x / 100
# discount = a - b
# print("Ціна зі знижкою:" + " " + str(discount))

# 5. “Остання цифра числа”
# Користувач вводить ціле число, програма виводить його останню цифру.

# a = int(input("Введіть ціле число: "))
# _, d = divmod(a, 10)
# print(d)

# 6. “Периметр прямокутника”
# Користувач вводить довжину і ширину. Програма виводить периметр.

# a = int(input("Введіть довжину: "))
# b = int(input("Введіть ширину: "))
# p = (a + b) * 2
# print("Периметр прямокутника:", p)


# 7. Виведення числа в стовпчик
# Працює з 0

# number = int(input("Введіть 4-х значне число: "))
# d1, remainder = divmod(number, 1000)
# d2, remainder = divmod(remainder, 100)
# d3, remainder = divmod(remainder, 10)
# d4 = remainder
# print(d1)
# print(d2)
# print(d3)
# print(d4)

